1password
amazon-cloud-drive
audioscrobbler
bartender
blockblock
caffeine
calibre
carbon-copy-cloner
cord
cyberduck
dash
drobo-dashboard
dropbox
firefox
flux
gfxcardstatus
google-chrome
google-drive
google-drive
grandperspective
iterm2
jumpcut
linein
little-snitch
musicbrainz-picard
quicksilver
screenhero
sequel-pro
skype
slack
soundsource
stay
superduper
synergy
tangerine
the-unarchiver
vagrant
virtualbox
viscosity
vlc
wakeonlan
xld