# -*- mode: ruby -*-

brew 'aspell'
brew 'cask'
brew 'emacs', args: ['with-cocoa', 'with-gnutls', 'with-imagemagick@6']
brew 'git'
brew 'go'
brew 'graphviz'
brew 'heroku-toolbelt'
brew 'hub'
brew 'markdown'
brew 'media-info'
brew 'most'
brew 'mysql', restart_service: true, link: true
brew 'nmap'
brew 'pidof'
brew 'postgresql', restart_service: true, link: true
brew 'rbenv'
brew 'ruby-build'
brew 'sl'
brew 'sqlite'
brew 'the_silver_searcher'
brew 'wget'
brew 'youtube-dl'
brew 'zsh'

cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'caskroom/drivers'

cask '1password'
# cask 'amazon-drive' FIXME: formula busted, manually install
cask 'audioscrobbler'
cask 'bartender'
cask 'blockblock'
cask 'caffeine'
cask 'calibre'
cask 'carbon-copy-cloner'
cask 'cord'
cask 'cyberduck'
cask 'dash'
cask 'drobo-dashboard'
cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'fujitsu-scansnap-manager-s1300'
cask 'gfxcardstatus'
cask 'google-chrome'
cask 'grandperspective'
cask 'iterm2'
cask 'keybase'
cask 'kindlegen'
cask 'little-snitch'
cask 'musicbrainz-picard'
cask 'pgweb'
cask 'quicksilver'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'soundsource'
cask 'stay'
cask 'superduper'
cask 'synergy'
cask 'tangerine'
cask 'the-unarchiver'
cask 'vagrant'
cask 'virtualbox'
cask 'viscosity'
cask 'vlc'
cask 'wakeonlan'
cask 'xld'
