# -*- mode: ruby -*-

brew 'aspell'
brew 'cask'
brew 'emacs', args: ['with-cocoa', 'with-gnutls', 'with-imagemagick@6']
brew 'git'
brew 'go'
brew 'graphviz'
brew 'heroku-toolbelt'
brew 'hub'
brew 'markdown'
brew 'media-info'
brew 'most'
brew 'mysql', restart_service: true, link: true
brew 'nmap'
brew 'pidof'
brew 'postgresql', restart_service: true, link: true
brew 'rbenv'
brew 'ruby-build'
brew 'sl'
brew 'sqlite'
brew 'the_silver_searcher'
brew 'wget'
brew 'youtube-dl'
brew 'zsh'

cask_args appdir: '/Applications'
tap 'caskroom/cask'

cask 'kindlegen'
